In [3]:
import pandas as pd

In [4]:
# creating series that will be input into a dataframe
student_1 = pd.Series({'Name':'Shashwat',
                        'Course':'FAI',
                       'Grade':85})
student_2 = pd.Series({'Name':'Shashwat',
                        'Course':'IR',
                       'Grade':96})
student_3 = pd.Series({'Name':'Aatish',
                        'Course':'CSS',
                       'Grade':92})

In [5]:
# creating a dataframe by specifying a list of indexes
students = pd.DataFrame([student_1, student_2, student_3], index = ['Student 1', 'Student 1', 'Student 3'])
students

          Course  Grade      Name
Student 1    FAI     85  Shashwat
Student 1     IR     96  Shashwat
Student 3    CSS     92    Aatish

In [6]:
students.iloc[0]   # accessing rows in a dataframe using iloc

Course         FAI
Grade           85
Name      Shashwat
Name: Student 1, dtype: object

In [7]:
students.loc['Student 1']  # accessing a particular index using loc

          Course  Grade      Name
Student 1    FAI     85  Shashwat
Student 1     IR     96  Shashwat

In [8]:
type(students.loc['Student 1']) # if there are more than one index they are returned as a dataframe

pandas.core.frame.DataFrame

In [9]:
type(students.loc['Student 3']) # else a single row is returned as a series

pandas.core.series.Series

In [10]:
students['Course'] # accessing a single column in a dataframe

Student 1    FAI
Student 1     IR
Student 3    CSS
Name: Course, dtype: object

In [11]:
students.T # returns the transpose of the dataframe and makes the columns as indices

       Student 1 Student 1 Student 3
Course       FAI        IR       CSS
Grade         85        96        92
Name    Shashwat  Shashwat    Aatish

In [12]:
students.loc['Student 1', 'Course'] # returns the courses taken by student 1

Student 1    FAI
Student 1     IR
Name: Course, dtype: object

In [13]:
students.loc['Student 3']['Grade'] # accessing individual cells using chaining

92

In [14]:
students.loc['Student 3']['Name'] = 'Shashank' # chaining only creates a copy and the change in value is not reflected
students

D:\Softwares\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

          Course  Grade      Name
Student 1    FAI     85  Shashwat
Student 1     IR     96  Shashwat
Student 3    CSS     92    Aatish

In [15]:
students.loc[:, ['Name', 'Grade']] # to access all rows and specific columns using loc

               Name  Grade
Student 1  Shashwat     85
Student 1  Shashwat     96
Student 3    Aatish     92

In [16]:
copy_students = students.drop('Student 3') # returns a copy of dataframe with the row Student 3 deleted
copy_students

          Course  Grade      Name
Student 1    FAI     85  Shashwat
Student 1     IR     96  Shashwat

In [17]:
students # original dataframe remains intact

          Course  Grade      Name
Student 1    FAI     85  Shashwat
Student 1     IR     96  Shashwat
Student 3    CSS     92    Aatish

In [18]:
students['Grade'] += 2 # applying mathematical operations on the whole column
students

          Course  Grade      Name
Student 1    FAI     87  Shashwat
Student 1     IR     98  Shashwat
Student 3    CSS     94    Aatish

In [19]:
del students['Course'] # deletes the column Course from the dataframe
students

           Grade      Name
Student 1     87  Shashwat
Student 1     98  Shashwat
Student 3     94    Aatish

In [20]:
students['University'] = 'Northeastern' # adds a column using direct indexing of the dataframe
students

           Grade      Name    University
Student 1     87  Shashwat  Northeastern
Student 1     98  Shashwat  Northeastern
Student 3     94    Aatish  Northeastern

In [21]:
grades = students['Grade'] #retrieving a column from the dataframe
type(grades)

pandas.core.series.Series

In [22]:
grades -= 2 # operation on the series/column of data gets reflected on the original dataframe as well
grades

Student 1    85
Student 1    96
Student 3    92
Name: Grade, dtype: int64

In [23]:
students

           Grade      Name    University
Student 1     85  Shashwat  Northeastern
Student 1     96  Shashwat  Northeastern
Student 3     92    Aatish  Northeastern

In [24]:
!cat olypics.csv # cat command is used to view other files in this environment (wont work on windows)

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [31]:
odf = pd.read_csv('olympics.csv') # reading csv files using pandas
odf.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !,02 !,03 !,Total,№ Games,01 !,02 !,03 !,Combined total
1,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12

In [36]:
# index_col is used to indicate the column that needs to be indexed
# skiprows indicates the row that we want to be ignored
odf = pd.read_csv('olympics.csv', index_col = 0, skiprows = 1)
odf.head()

,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [37]:
 odf.columns # the list of columns in the dataframe

Index(['№ Summer', '01 !', '02 !', '03 !', 'Total', '№ Winter', '01 !.1',
       '02 !.1', '03 !.1', 'Total.1', '№ Games', '01 !.2', '02 !.2', '03 !.2',
       'Combined total'],
      dtype='object')

In [41]:
# renaming the columns 01, 02 & 03 with Gold, Silver & Bronze respectively
odf.rename(columns = {'01 !' : 'Gold', '02 !' : 'Silver', '03 !' : 'Bronze'}, inplace = True)
odf.head()

,№ Summer,Gold,Silver,Bronze,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12